Repository: Nuitka/Nuitka-website
Catalog: locales/*/LC_MESSAGES/index.po
Languages: de_de, zh_cn

source: Nuitka Website
de_de: Nuitka Webseite

source: Thanks
de_de: Danke

source: Please help and improve this in all ways, typos, cooler tech, better looks, more information, etc. all is appreciated and necessary.
de_de: Bitte helfen Sie mit und verbessern Sie es in jeder Hinsicht, Tippfehler, coolere Technik, besseres Aussehen, mehr Informationen, usw. alles ist willkommen und notwendig.

source: Right now, this is very much possible to improve. Your turn!
de_de: Im Moment ist es sehr gut möglich, dies zu verbessern. Sie sind dran!

source: Usage
de_de: Verwendung

source: This is used to build the Nuitka web site. Enhancements of all kinds are welcome. You will need python 3.9 and ``pipenv`` to build it.
de_de: Damit wird die Nuitka-Website aufgebaut. Erweiterungen aller Art sind willkommen. Du brauchst Python 3.9 und ``pipenv``, um es zu bauen.

source: Usage of Sphinx
de_de: Verwendung von Sphinx

source: So the site is basically mostly an automation of importing a few files from the Nuitka git repository, splitting up e.g. the ``Changelog.rst`` into pages, with otherwise using Sphinx to render it. Reference the Sphinx documentation and esp. the one for Read the Docs theme and ABlog.
de_de: Die Seite ist also im Grunde eine Automatisierung des Imports einiger Dateien aus dem Nuitka git repository, die z.B. die ``Changelog.rst`` in Seiten aufteilt und ansonsten Sphinx zum Rendern verwendet. Siehe die Sphinx-Dokumentation, insbesondere die für das Thema Read the Docs und ABlog.

source: Translation
de_de: Übersetzung

source: Translations of the Nuitka website are very welcome. We have a team for those want to work on it, with push rights to the repository. Right now a ``translation`` branch is used, but the plan is for it to be merged, and to provide the infrastructure in the ``main`` branch.
de_de: Übersetzungen der Nuitka-Website sind sehr willkommen. Wir haben ein Team für diejenigen, die daran arbeiten wollen, mit Push-Rechten für das Repository. Im Moment wird ein ``translation`` Zweig verwendet, aber der Plan ist, diesen zusammenzuführen und die Infrastruktur im ``main`` Zweig bereitzustellen.

source: Here is a table of the files to translate and their styles. Everything that is not mentioned here, should be asked about if in doubt. Not all pages make sense to translate.
de_de: Hier ist eine Tabelle mit den zu übersetzenden Dateien und ihren Stilen. Alles, was hier nicht aufgeführt ist, sollte im Zweifelsfall nachgefragt werden. Nicht alle Seiten sind sinnvoll zu übersetzen.

source: Before translating, I would love you to also actually review the content, if you agree it makes sense, if it can be better structured. This is very much needed unfortunately.
de_de: Ich würde mich freuen, wenn Sie vor der Übersetzung auch den Inhalt überprüfen würden, ob er sinnvoll ist und ob er besser strukturiert werden kann. Das ist leider sehr nötig.

source: There are plans to get rid of ``pages`` and ``doc`` sub-folders of the site folder ``doc``. For URLs, these are plain bad, and would e.g. be much better as ``python-compiler`` and the like. A plan will be devised and put into place, but it will just move and renamed pages.
de_de: Es gibt Pläne, die Unterordner ``pages`` und ``doc`` des Site-Ordners ``doc`` abzuschaffen. Für URLs sind diese einfach schlecht, und wären z.B. viel besser als ``python-compiler`` und dergleichen. Es wird ein Plan ausgearbeitet und umgesetzt, aber es werden nur Seiten verschoben und umbenannt.

source: Directory ``posts/``
de_de: Ordner ``posts/``

source: At this time, the blog posts, esp. old ones should not be translated. I believe often new content will be created in post form, and then moved over to pages for translation. A current example are tutorial style pages including screenshots, which depending on how the e.g. Python installer look in your language, Explorer and shell prompt, even screenshots might have to be translated. This will come only later though.
de_de: Zur Zeit sollten die Blogeinträge, vor allem die alten, nicht übersetzt werden. Ich glaube, dass neue Inhalte oft in Form von Beiträgen erstellt werden und dann zur Übersetzung auf Seiten verschoben werden. Ein aktuelles Beispiel sind Seiten im Stil eines Tutorials mit Screenshots, die je nachdem, wie z.B. der Python-Installer in Ihrer Sprache, der Explorer und die Shell-Eingabeaufforderung aussehen, auch übersetzt werden müssen. Das wird aber erst später kommen.

source: Page ``pages/donations.rst``
de_de: Seite ``pages/donations.rst``

source: Yes, please go ahead. Let me know if there is any need to hint Paypal, or when Paypal is not available in your country, what alternative ways we could use.
de_de: Ja, bitte machen Sie weiter. Lassen Sie mich wissen, ob es notwendig ist, auf Paypal hinzuweisen, oder wenn Paypal in Ihrem Land nicht verfügbar ist, welche alternativen Möglichkeiten wir nutzen können.

source: Page ``pages/overview.rst``
de_de: Seite ``pages/overview.rst``

source: Page ``pages/pyside2.rst``
de_de: Seite ``pages/pyside2.rst``

source: Very important kind of page, of which I want to have more. Nuitka links itself to this from the plugin, and it's a landing page to inform users about troubles that can be expected. We want to have some boilerplate for this, and a general way of adding these. These user hint pages are where I think we ought to help the users from real Nuitka to find the information, and even localized for their needs.
de_de: Sehr wichtige Art von Seite, von der ich mehr haben möchte. Nuitka verlinkt sich selbst mit dieser Seite aus dem Plugin, und es ist eine Landing Page, um Benutzer über zu erwartende Probleme zu informieren. Wir wollen dafür eine Art Boilerplate haben und eine allgemeine Möglichkeit, diese hinzuzufügen. Diese Benutzer-Hinweis-Seiten sind der Ort, an dem wir meiner Meinung nach den Benutzern von Nuitka helfen sollten, die Informationen zu finden.

source: Page ``pages/support.rst``
de_de: Seite ``pages/support.rst``

source: This one is not mentioning the Discord server yet, I will add that soon though. Very important page that should be linked to from many places.
de_de: Hier wird der Discord-Server noch nicht erwähnt, ich werde das aber bald hinzufügen. Sehr wichtige Seite, die von vielen Stellen aus verlinkt werden sollte.

source: Page ``pages/gsoc2019.rst``
de_de: Seite ``pages/gsoc2019.rst``

source: This is historical information, translation makes no sense, not sure what to do with it. But if Nuitka were to do it again, we would translate it ideally for the next time.
de_de: Das ist eine historische Information, die Übersetzung macht keinen Sinn, wir wissen nicht, was wir damit anfangen sollen. Aber wenn Nuitka es noch einmal machen würde, würden wir es für das nächste Mal idealerweise übersetzen.

source: Page ``pages/impressum.rst``
de_de: Seite ``pages/impressum.rst``

source: This one is required by law in my country, translators might want to add their information here. I cannot take responsibility for the content of translations, as I cannot verify it in many cases.
de_de: Dies ist in meinem Land gesetzlich vorgeschrieben, Übersetzer sollten hier ihre Informationen hinzufügen. Ich kann keine Verantwortung für den Inhalt der Übersetzungen übernehmen, da ich ihn in vielen Fällen nicht überprüfen kann.

source: Page ``pages/Presentations.rst``
de_de: Seite ``pages/Presentations.rst``

source: This one probably should get more love content wise. It's under construction. I want to go over the blog and link all information from there. But if you are aware of material in your language, please go ahead and add it.
de_de: Diesem sollte wahrscheinlich mehr Aufmerksamkeit geschenkt werden, was den Inhalt betrifft. Er befindet sich im Aufbau. Ich möchte den Blog überarbeiten und alle Informationen von dort verlinken. Aber wenn Sie Material in Ihrer Sprache kennen, fügen Sie es bitte hinzu.

source: Page ``Streaming.rst``
de_de: Seite ``Streaming.rst``

source: Since this about an English offer, not sure it makes sense, I will also update it in near future somewhat, but making clear it's going to be an English content, I think it ought to be translated on a basic level at the beginning of the page, and then have untranslated content?
de_de: Da es sich um ein englisches Angebot handelt, bin ich mir nicht sicher, ob es Sinn macht, ich werde es in naher Zukunft auch etwas aktualisieren, aber um klarzustellen, dass es ein englischer Inhalt sein wird, denke ich, dass es auf einer grundlegenden Ebene am Anfang der Seite übersetzt werden sollte, der Rest nicht?

source: Page ``doc/api-doc.rst``
de_de: Seite ``doc/api-doc.rst``

source: Translation makes no sense and cannot be done currently anyway. The API doc is going to be generated with Spinx, Doxygen docs are without love.
de_de: Eine Übersetzung macht keinen Sinn und kann derzeit ohnehin nicht durchgeführt werden. Die API-Dokumentation wird mit Sphinx erstellt, Doxygen-Dokumente sind lieblos.

source: Page ``doc/commercial.rst`` and folder ``commercial``
de_de: Seite ``doc/commercial.rst`` und Ordner ``commercial``

source: Translation is very welcome. There will be more content added over time. For payment options, please check out if they work for your country and if not, help me find alternatives. I was e.g. rejected for AliPay in China, but maybe other things can work. And Russia e.g. has no Paypal (which I mean to add as an alternative still).
de_de: Die Übersetzung ist sehr willkommen. Mit der Zeit werden weitere Inhalte hinzugefügt. Was die Zahlungsmöglichkeiten angeht, so prüfen Sie bitte, ob sie in Ihrem Land funktionieren und wenn nicht, helfen Sie mir, Alternativen zu finden. Ich wurde z.B. für AliPay in China abgelehnt, aber vielleicht funktionieren andere Dinge. Und Russland hat z.B. kein Paypal (was ich als Alternative noch hinzufügen möchte).

source: Page ``doc/factory.rst``
de_de: Seite ``doc/factory.rst``

source: Very useful to have it translated.
de_de: Es ist sehr nützlich, es übersetzt zu haben.

source: Page ``doc/welcome.rst``
de_de: Seite ``doc/welcome.rst``

source: This is just a playground for me, do not translate, unless we want to play around with translation mechanics. We will want to e.g. have an intelligent language switcher at some point, and could try it out there.
de_de: Das ist nur ein Spielplatz für mich, nicht übersetzen, es sei denn, wir wollen mit Übersetzungsmechanismen herumspielen. Wir werden z.B. irgendwann einen intelligenten Sprachwechsler haben wollen und könnten ihn dort ausprobieren.

source: Page ``doc/Changelog.rst``
de_de: Seite ``doc/Changelog.rst``

source: Do not translate, this is a bizarre amount of work.
de_de: Übersetzen Sie nicht, das ist ein bizarrer Aufwand.

source: Page ``download.rst``
de_de: Seite ``download.rst``

source: Very welcome, but beware that ``download.rst.j2`` is the real source. Tables are generated into the document, this is probably a harder case technically, so hold off until this is sorted out.
de_de: Sehr willkommen, aber Vorsicht, ``download.rst.j2`` ist die eigentliche Quelle. Tabellen werden in das Dokument generiert, dies ist wahrscheinlich ein technisch schwierigerer Fall, also warten Sie, bis dies geklärt ist.

source: Page ``developer-manual.rst``
de_de: Seite ``developer-manual.rst``

source: Makes no sense to translate. But potentially there is content that belongs to user manual in there or should be split off.
de_de: Es macht keinen Sinn, zu übersetzen. Möglicherweise gibt es aber Inhalte, die in das Benutzerhandbuch gehören oder abgetrennt werden sollten.

source: Page ``roadmap.rst``
de_de: Seite ``roadmap.rst``

source: Much like changelog, not as much work, but also not as important.
de_de: Ähnlich wie der Changelog, nicht so viel Arbeit, aber auch nicht so wichtig.

source: Page ``doc/user-manual.rst``
de_de: Seite ``doc/user-manual.rst``

source: This one is most important in my mind, optimization section needs a serious update from my side, maybe ignore that, until I get there. Review applies here very much. I think Tutorial parts might be factored out to separate documents.
de_de: Das ist meiner Meinung nach das Wichtigste. Der Bereich Optimierung braucht ein ernsthaftes Update von meiner Seite, vielleicht ignoriere ich das, bis ich dazu komme. Review trifft hier sehr gut zu. Ich denke, dass die Tutorial-Teile in separate Dokumente ausgelagert werden könnten.

source: How to translate
de_de: Wie wird übersetzt

source: Under locales in the folder with the language code you will then have many .po files. In the .po file you can see ``msgid`` and below it ``msgstr``. ``msgid`` contains the english original, in ``msgstr`` you can write the translation. If you then want to transfer your changes via PR, please commit **only** the files you have translated.
de_de: Unter locales in dem Ordner mit dem Sprachkürzel sind viele .po Dateien. In der .po Datei kannst du ``msgid`` und darunter ``msgstr`` sehen. In ``msgid`` befindet sich das englische Original, in ``msgstr`` kannst du die Übersetzung reinschreiben. Bitte committe **nur** die Dateien, die du übersetzt hast, wenn du deine Änderungen per PR hochlädst.

source: Image Optimization
de_de: Bild Optimierung

source: Download
zh_cn: 下载

source: User Manual
zh_cn: 用户手册

source: Roadmap
zh_cn: 路线图

source: Commercial Users
zh_cn: 商业用户

source: Other
zh_cn: 其他

source: Under construction
zh_cn: 建设中

source: With the Python compiler Nuitka you create protected binaries out of your Python source code.
zh_cn: 使用 Python 编译器 Nuitka，你可以在 Python 源代码中创建受保护的二进制文件。

source: Nuitka the Python Compiler
zh_cn: Nuitka Python 编译器

source: Nuitka Blog
zh_cn: Nuitka 博客

source: What is Nuitka
zh_cn: Nuitka 是什么

source: Nuitka is the optimizing Python compiler written in Python that creates executables that run without an need for a separate installer. Data files can both be included or put alongside.
zh_cn: Nuitka 是用 Python 编写的优化 Python 编译器，它可以创建不需要单独安装程序就能运行的可执行文件。数据文件既可以包含，也可以放在旁边。

source: It is fully compatible with Python2 (2.6, 2.7) and Python3 (3.3 - 3.10), works on Windows, macOS, Linux and more, basically where Python works for you already.
zh_cn: 它完全兼容 Python2（2.6, 2.7）和 Python3（3.3 - 3.10），可以在 Windows, macOS, Linux 等操作系统上运行，基本上 Python 已经可以为你工作了。

source: It protects your code and data, esp. with the Nuitka commercial offering, and also just works and is easy to use.
zh_cn: 它保护你的代码和数据，特别是与 Nuitka 的商业提供，也只是可工作和易于使用。

source: Nuitka is freely distributed under the Apache license. Nuitka commercial is a private repository that you pay to access and get plugins for commercial usage.
zh_cn: Nuitka 是在 Apache 许可下免费发布的。Nuitka commercial 是一个私有的存储库，你可以付费访问并获得用于商业用途的插件。

source: In the meantime you can checkout why `Nuitka commercial </doc/commercial.html>`__ is for you or find the its `standard version here </pages/download.html>`_.
zh_cn: 与此同时，你可以检查为什么 `Nuitka commercial </doc/commercial.html>`__ 是为你或找到它的 `标准版本在这里 </pages/download.html>`_。
